ws-asahi/UkiUkiCore/megaavr/boards.txt
# =====================================================================
#  UkiUkiCore - boards.txt
#  The UkiUkiduino product board only (all other MCU/board families from
#  DxCore / WazamonoCore are removed):
#    - UkiUkiduino  (AVR64DU32, Arduino Uno R3 form factor, USB-C)
#  Derived from DxCore's avrduusb (USB-CDC bootloader) definition via
#  WazamonoCore; DxCore (C) Spence Konde, LGPL 2.1.
#  Customizations (C) Workshop Asahi.
#
#  The UkiUkiduino is CRYSTAL-LESS by design and is aimed at beginners:
#  there is no Clock menu - the system clock is fixed to the internal
#  24 MHz OSCHF (build.speed / build.clocksource below), and PA0/PA1 are
#  free GPIO (D7 / D20). USB CLK_USB (48 MHz) = OSCHF + PLL48M, SOF-tuned,
#  independent of the system clock.
# =====================================================================

# =====================  UkiUkiduino (AVR64DU32)  =====================
#  Arduino Uno R3 form factor. AVR64DU32 + USB-CDC bootloader. Timer use:
#  millis() is on TCB0 so TCB1 is free for D3 PWM (TCB1 ALT1 = PF5) and
#  for tone() (Tone.cpp routes tone to TCB1 whenever millis is on TCB0;
#  tone therefore shares TCB1 with D3 PWM - using tone() suspends D3 PWM
#  only, exactly like Uno R3's Timer2, but D11 PWM (TCA0) is preserved).
menu.clock=Clock Speed
menu.usbeps=USB Endpoints

ukiukiduino.name=UkiUkiduino

ukiukiduino.upload.tool=avrdude
ukiukiduino.upload.prog_interlock=
# --- USB identity: pid.codes TEST-range placeholders (app 0x000C / boot 0x000B).
#     Replace with the official pid.codes VID/PID before release. Keep in sync
#     with variants/UkiUkiduino/pins_arduino.h and the bootloader build. ---
ukiukiduino.vid.0=0x1209
ukiukiduino.pid.0=0x000C
ukiukiduino.vid.1=0x1209
ukiukiduino.pid.1=0x000B
ukiukiduino.build.board=AVR_UKIUKIDUINO
ukiukiduino.build.core=dxcore
ukiukiduino.build.f_cpu={build.speed}000000L
ukiukiduino.build.text_section_start=.text=0x1000
ukiukiduino.build.defaultswaps=
ukiukiduino.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT -DUSB_VREG_INTERNAL {build.usbepflags}
ukiukiduino.menu.usbeps.ep8=8 (EP0-EP7, standard)
ukiukiduino.menu.usbeps.ep8.build.usbepflags=
ukiukiduino.menu.usbeps.ep16=16 (EP0-EP15, extended)
ukiukiduino.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/UkiUkiduino/ukiukiduino_init.cpp).
# Arduino archives variant objects into core.a, so its strong initVariant() that
# sets up the CCL/EVSYS LED mirror would otherwise be dropped (core main.cpp has
# a weak initVariant). -u pulls the member; the marker symbol is in that file.
ukiukiduino.compiler.c.elf.extra_flags=-Wl,-u,ukiukiduino_variant_keep -Wl,--defsym,__flmap_lock=1
ukiukiduino.build.rodata_flags=
ukiukiduino.build.export_merged_output=false
ukiukiduino.build.printf=
ukiukiduino.build.flmapopts=
ukiukiduino.build.attachmode=-DCORE_ATTACH_ALL
ukiukiduino.bootloader.tool=avrdude
ukiukiduino.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
ukiukiduino.bootloader.wdtwindowbits=0000
ukiukiduino.bootloader.BODCFG=0x00
ukiukiduino.bootloader.updipinbit=1
ukiukiduino.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
ukiukiduino.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
ukiukiduino.bootloader.CODESIZE=0x00
ukiukiduino.bootloader.BOOTSIZE=0x08
ukiukiduino.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
# Bootloader fuse bits (burn-bootloader): WDT off, BOD off, EEPROM retained,
#   reset pin = Hardware Reset, startup 8ms. (BODCFG fixed above = 0x00.)
ukiukiduino.bootloader.wdttimeoutbits=0000
ukiukiduino.bootloader.eesavebit=1
ukiukiduino.bootloader.resetpinbit=1
ukiukiduino.bootloader.sutbits=100
# Compile-time options: millis=TCB0 (frees TCB1 for D3 PWM + tone), Wire=single.
ukiukiduino.build.millistimer=B0
ukiukiduino.build.wiremode=MORS_SINGLE
ukiukiduino.bootloader.resetpinbits={bootloader.resetpinbit}
ukiukiduino.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduino.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduino.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
ukiukiduino.bootloader.pymcuprogstring=-aerase
ukiukiduino.build.mcupostfix=
ukiukiduino.build.printfabr=
ukiukiduino.build.flmapabr=.ful
ukiukiduino.build.attachabr=
ukiukiduino.build.wireabr=.wO
ukiukiduino.build.appspmabr=
ukiukiduino.upload.protocol=arduino
ukiukiduino.upload.speed=115200
ukiukiduino.upload.extra_params=-D
ukiukiduino.upload.use_1200bps_touch=true
ukiukiduino.upload.wait_for_upload_port=true
ukiukiduino.bootloader.file=hex/{bootloader.class}.hex
ukiukiduino.bootloader.appspm=

# --- Clock: fixed 24 MHz internal OSCHF (crystal-less; no Clock menu). ---
#  clocksource 0 = internal OSCHF. USB CLK_USB (48 MHz) = OSCHF + PLL48M, SOF-tuned.
ukiukiduino.menu.clock.24internal=24 MHz internal
ukiukiduino.menu.clock.24internal.build.speed=24
ukiukiduino.menu.clock.24internal.build.clocksource=0
ukiukiduino.menu.clock.16internal=16 MHz internal
ukiukiduino.menu.clock.16internal.build.speed=16
ukiukiduino.menu.clock.16internal.build.clocksource=0

# --- Locked to AVR64DU32. Variant + bootloader hex fixed to UkiUkiduino. ---
ukiukiduino.build.mcu=avr64du32
ukiukiduino.build.variant=UkiUkiduino
ukiukiduino.build.highestcb=B2
ukiukiduino.upload.maximum_size=61440
ukiukiduino.upload.maximum_data_size=8192
ukiukiduino.bootloader.class=usbcdcboot_ukiukiduino
